etc/docs/tsp_file_funcs.tex
% Created 2018-05-13 Sun 20:56
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Brad Saylor}
\date{\today}
\title{Outline of tsprogram File Functions}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Save}
\label{sec-1}
\subsection{Determine if file has been named}
\label{sec-1-1}
\subsubsection{if not send to name()}
\label{sec-1-1-1}
\subsection{Determine if group has been named}
\label{sec-1-2}
\subsubsection{if not name group = 'file name'}
\label{sec-1-2-1}
\subsection{Determine if group name is unique}
\label{sec-1-3}
\subsubsection{search .grp manifest for group ID}
\label{sec-1-3-1}
\subsubsection{if already exists prompt for a new name and store}
\label{sec-1-3-2}
\subsection{Determine if file is a group target}
\label{sec-1-4}
\subsubsection{if yes then}
\label{sec-1-4-1}
\begin{enumerate}
\item Determine if group already has a target file
\label{sec-1-4-1-1}
\begin{enumerate}
\item if yes then ask if it should be replaced
\label{sec-1-4-1-1-1}
\begin{enumerate}
\item if no then exit save()
\label{sec-1-4-1-1-1-1}
\end{enumerate}
\end{enumerate}
\item Set local flag to indicate this is target
\label{sec-1-4-1-2}
\end{enumerate}
\subsection{Prepare data set for writing out}
\label{sec-1-5}
\subsubsection{stored in array}
\label{sec-1-5-1}
\begin{enumerate}
\item first three elements -> name, modified, ref Y/N
\label{sec-1-5-1-1}
\item Next elements are tsp parameter names and values
\label{sec-1-5-1-2}
\item Last element is a blank line
\label{sec-1-5-1-3}
\end{enumerate}
\subsection{Open file}
\label{sec-1-6}
\subsection{Check to see if file size plus pending data will exceed limit}
\label{sec-1-7}
\subsubsection{If so display error and exit back to main()}
\label{sec-1-7-1}
\subsubsection{If not continue}
\label{sec-1-7-2}
\subsection{If target flag is set then re-write file replacing any "ref: Y" with "ref: N"}
\label{sec-1-8}
\subsection{Search through .grp file to find alphabetic insert point}
\label{sec-1-9}
\subsubsection{If found start caching existing file lines and writing out data}
\label{sec-1-9-1}
\begin{enumerate}
\item When data write is finished append a blank line
\label{sec-1-9-1-1}
\item Write out the cached data appended below the blank line
\label{sec-1-9-1-2}
\end{enumerate}
\subsubsection{If not found append data to end of file}
\label{sec-1-9-2}
\subsection{close file}
\label{sec-1-10}
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}